podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/IWDG_STM32F030.svd.xml
<!--
Devices using this peripheral: 
      STM32F030
-->
      <peripheral>
         <?sourceFile "IWDG_STM32F030" ?>
         <name>IWDG</name>
         <description>Independent watchdog</description>
         <groupName>IWDG</groupName>
         <headerStructName>IWDG</headerStructName>
         <baseAddress>0x40003000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x4</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>KR</name>
               <description>Key register</description>
               <addressOffset>0x0</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Key value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PR</name>
               <description>Prescaler register</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>PR</name>
                     <description>Prescaler divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RLR</name>
               <description>Reload register</description>
               <addressOffset>0x8</addressOffset>
               <resetValue>0xFFF</resetValue>
               <fields>
                  <field>
                     <name>RL</name>
                     <description>Watchdog counter reload
              value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status register</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PVU</name>
                     <description>Watchdog prescaler value
              update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RVU</name>
                     <description>Watchdog counter reload value
              update</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WVU</name>
                     <description>Watchdog counter window value
              update</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WINR</name>
               <description>Window register</description>
               <addressOffset>0x10</addressOffset>
               <resetValue>0xFFF</resetValue>
               <fields>
                  <field>
                     <name>WIN</name>
                     <description>Watchdog counter window
              value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
